# 公众号配置
# 公众号appId
app_id = "wx6b1a75d334dac8ee"
# 公众号appSecret
app_secret = "098504408b1dcbdf4194f5624a05712a"
# 模板消息id
# 每日消息
template_id1 = "jt8r-qQhdLmY5ei9X20Cv5NLagZ3q4hHGexyM_S_umk"
# 课程消息,上课提醒
template_id2 = "m-aOUbktwHQ3LJi5Zc_oo_dtfd001ghaqWOWEzJfs7k"
# 晚安心语
template_id3 = "_UO4zJPjD0SZIVu7F9ZhI60S-OO1s_Y08FoSUp8zikI"
# 接收公众号消息的微信号
# 这是openid
user = ["ow8NE6dtY26wAAEQCEYen7rLyylQ"]

# 信息配置
# 所在省份
province = "浙江"
# 所在城市
city = "温州"
# 生日，如果月份或者日期小于10，直接用对应的数字即可，例如1997-1-1，---------倒计时
birthday = "2004-8-16"
# 在一起的日子，格式同上------------计时器
love_date = "2023-10-15"
# 天行数据晚安心语 key
good_Night_Key = "723830aa136d1ef221b3eda2e9e542ec"
# -------------------------------------------------------------------------
# 设置学期第一周开始日期
year = 2023
month = 8
day = 28
# 每日推送时间
post_Time = "07:10:00"
# 每节课提醒时间（有课才会提醒）, 时:分:秒  的形式, 字符串, 根据个人需要设置几次
time_table = ["07:50:00", "9:45:00", "13:10:00", "15:05:00"]
# 课程时间
course_Time = ["8:10--9:40", "10:05--11:35", "13:30--15:00", "15:25--16:55"]
# 晚安心语及第二天课程推送时间
good_Night_Time = "22:30:00"
# 课程表 "1"代表第一周，依次类推，根据个人实际课表添加，有几周就添加几周,
# 每一行代表一天, 例如  ['', '编译原理', '', '数据库原理及应用', '数据分析原理', '']  代表周一
classes = \
    {
        "1": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "2": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "3": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "4": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "5": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "6": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "7": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "8": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "9": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "10": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "11": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "12": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '形势与政策3 教2-403', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "13": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '形势与政策3 教2-403', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "14": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '形势与政策3 教2-403', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "15": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '形势与政策3 教2-403', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "16": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "17": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "18": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "19": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "20": [
            ['JavaEE开发 实1-417', 'JavaEE开发 实1-417', '体育', '', '', ''],
            ['移动应用软件开发 实1-417', '移动应用软件开发 实1-417', '', '', '', ''],
            ['Java应用程序开发 实1-417', '数据分析与应用 教2-503', '', '', '', ''],
            ['Vue.js前端开发 教2-503', '软件工程与项目管理 实1-417', '数据分析与应用 教2-503', '', '', ''],
            ['Java应用程序开发 实1-417', 'Vue.js前端开发 教2-503', '', '', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
    }

# 模板 1：每日提醒模板
# 本周是开学的第: {{weeks.DATA}} 周
# 今天是: {{date.DATA}}
# 城市： {{city.DATA}}
# 天气： {{weather.DATA}}
# 最低气温: {{min_temperature.DATA}}
# 最高气温: {{max_temperature.DATA}}
# 今天是破壳日的第: {{love_day.DATA}} 天
# 距离开学还有: {{birthday.DATA}} 天
# ----------------今日课程----------------
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}
# 第五讲: {{fifthClass.DATA}}
# 第六讲: {{sixthClass.DATA}}

# 模板 2 课程单推
# 课程信息: {{classInfo.DATA}}

# 模板 3 晚安心语推送和第二天课程推送
# {{goodNight.DATA}}
# ----------------明日课程----------------
# 明天是: {{week.DATA}}
# 第一讲: {{firstClass.DATA}}
# 第二讲: {{secondClass.DATA}}
# 第三讲: {{thirdClass.DATA}}
# 第四讲: {{fourthClass.DATA}}
# 第五讲: {{fifthClass.DATA}}
# 第六讲: {{sixthClass.DATA}}
